
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяСхема = Истина;
	ЗаполнитьПрефиксыПоУмолчаниюНаСервере();
	
	ЗаполнитьПараметрыПоУмолчанию();
			
	ДеревоОбъектовМетаданныхЗаполнить();
	
	Если РодительскиеПодсистемы.Количество() > 0 Тогда
		Элементы.ДеревоОбъектовМетаданных.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	КонецЕсли;
	
	НачальнаяПометкаКоллекций(ДеревоОбъектовМетаданных);
	
	ОбновитьВидимостьДоступность(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// Устанавливаем начальное значение выбора.
	Если ИдентификаторТекущейСтрокиПриОткрытии > 0 Тогда
		
		Элементы.ДеревоОбъектовМетаданных.ТекущаяСтрока = ИдентификаторТекущейСтрокиПриОткрытии;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#Область ОбработчикиСобытий_ДеревоОбъектовМетаданных

&НаКлиенте
Процедура ОтметитьПоПодсистемам(Команда)
		
	Оповещение = Новый ОписаниеОповещения("ОповещениеОЗавершенииОтбора", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("ВнешняяОбработка.ДиаграммаОбъектов1С.Форма.ОтборПоПодсистемам", ПараметрыФормы, ЭтаФорма, 
		УникальныйИдентификатор, , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
КонецПроцедуры

&НаКлиенте
Процедура ПометкаПриИзменении(Элемент)
	Пометка2 = 2;
	ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
	Если ТекущиеДанные.Пометка = Пометка2 Тогда
		ТекущиеДанные.Пометка = 0;
	КонецЕсли;
	ПометитьВложенныеЭлементы(ТекущиеДанные);
	ПометитьЭлементыРодителей(ТекущиеДанные);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_Шаг2

&НаКлиенте
Процедура ДекорацияШаг2ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматСтроки = "GenerateCode" Тогда
		СгенерироватьКодНаСервере();
		УдалятьНеСвязанныеОбъектыПриИзменении(Неопределено); // +++ OS
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКод(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьКодЗавершение", ЭтотОбъект);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = "Выберите Каталог и Имя файла";
	Диалог.ПолноеИмяФайла = "";
	
	Фильтр = "";
	СписокТиповФайлов = "txt,wsd,plantuml,iuml";
	МассивТиповФайлов = СтрРазделить(СписокТиповФайлов, ",");
	Для Каждого ИмяТип Из МассивТиповФайлов Цикл
		Фильтр = Фильтр + ВРЕГ(ИмяТип) + "-файл (*." + нрег(ИмяТип) + ")|*." + нрег(ИмяТип) + "|";
	КонецЦикла;
	Фильтр = Фильтр + "Все файлы (*.*)|*.*";
	Диалог.Фильтр = Фильтр;
	
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКод(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьКодЗавершение", ЭтотОбъект);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите Каталог и Имя файла";
	Диалог.ПолноеИмяФайла = ""; 
	
	Фильтр = "";
	СписокТиповФайлов = "txt,wsd,plantuml,iuml";
	МассивТиповФайлов = СтрРазделить(СписокТиповФайлов, ",");
	Для Каждого ИмяТип Из МассивТиповФайлов Цикл
		Фильтр = Фильтр + ВРЕГ(ИмяТип) + "-файл (*." + нрег(ИмяТип) + ")|*." + нрег(ИмяТип) + "|";
	КонецЦикла;
	Фильтр = Фильтр + "Все файлы (*.*)|*.*";
	Диалог.Фильтр = Фильтр;
	
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Показать(ОписаниеОповещения);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_Шаг3

&НаКлиенте
Процедура ДекорацияШаг3ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматСтроки = "GenerateScheme" Тогда 
		СгенерироватьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалятьНеСвязанныеОбъектыПриИзменении(Элемент)
	Если УдалятьНеСвязанныеОбъекты Тогда
		ИсходныйКод = ИсходныйКод + "
		|remove @unlinked";
	Иначе
		ИсходныйКод = СтрЗаменить(ИсходныйКод, "remove @unlinked", "");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_Настройки
&НаКлиенте
Процедура СтандартнаяСхемаПриИзменении(Элемент)
	ЗаполнитьПараметрыПоУмолчанию();
	Элементы.ГруппаПрефиксов.Доступность = СтандартнаяСхема;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокПоУмолчанию(Команда)
	ЗаполнитьПрефиксыПоУмолчаниюНаСервере();
	СтандартнаяСхемаПриИзменении(Неопределено);
КонецПроцедуры
#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОповещениеОЗавершенииОтбора(РезультатОтбора, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатОтбора) <> Тип("СписокЗначений") Тогда 
		Возврат;
	КонецЕсли;
	
	ЭлементыВерхнегоУровня = ДеревоОбъектовМетаданных.ПолучитьЭлементы();
	ЭлементыКлассовОбъектовМетаданных = ЭлементыВерхнегоУровня[0].ПолучитьЭлементы();
	
	ОтметитьПоОбъектамРекурсивно(ЭлементыКлассовОбъектовМетаданных, РезультатОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьПоОбъектамРекурсивно(Знач ЭлементыДерева, Знач РезультатОтбора, Очистить = Ложь)
	
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл // выключение всех других объектов
		ПодчиненныеЭлементыДерева = ЭлементДерева.ПолучитьЭлементы();
		Если НЕ ЭлементДерева.ЭтоОбъектМетаданных Тогда
			ОтметитьПоОбъектамРекурсивно(ПодчиненныеЭлементыДерева, РезультатОтбора, Истина);
		Иначе
			ЭлементДерева.Пометка = 0;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		ПодчиненныеЭлементыДерева = ЭлементДерева.ПолучитьЭлементы();
		Если НЕ ЭлементДерева.ЭтоОбъектМетаданных Тогда
			ОтметитьПоОбъектамРекурсивно(ПодчиненныеЭлементыДерева, РезультатОтбора);
		Иначе
			Если РезультатОтбора.НайтиПоЗначению(ЭлементДерева.ПолноеИмя) <> Неопределено Тогда
				ЭлементДерева.Пометка = 1;
				ПометитьЭлементыРодителей(ЭлементДерева);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// ------Запись---------------------------------------

&НаКлиенте
Процедура СохранитьКодЗавершение(Результат, ДопПараметры = Неопределено) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла =  Результат[0];
	
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.УстановитьТекст("@StartUML
	|' КодировкаТекста: UTF-8
	| " + ИсходныйКод + "
	|@EndUML");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьКодЗавершениеЗаписи", ЭтотОбъект);
	ТекстДок.НачатьЗапись(ОписаниеОповещения, ИмяФайла, "UTF-8");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКодЗавершениеЗаписи(УспешноеЗавершение, ДопПараметры = Неопределено) Экспорт
	Если УспешноеЗавершение Тогда
		ТекстСообщения = "Файл успешно сохранен.";
	Иначе
		ТекстСообщения = "Ошибка при записи в файл!";
	КонецЕсли;
	ПоказатьПредупреждение(, ТекстСообщения);
КонецПроцедуры

// ------Чтение---------------------------------------

&НаКлиенте
Процедура ОткрытьКодЗавершение(Результат, ДопПараметры = Неопределено) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла =  Результат[0];

	ТекстДок = Новый ТекстовыйДокумент;
	ПараметрыЧтения = Новый Структура("ТекстДок", ТекстДок);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьКодЗавершениеЧтения", ЭтаФорма, ПараметрыЧтения);
	
	ТекстДок.НачатьЧтение(ОписаниеОповещения, ИмяФайла, "UTF-8");

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКодЗавершениеЧтения(Результат) Экспорт
	Если Результат <> Неопределено Тогда
		ИсходныйКод = Результат.ТекстДок.ПолучитьТекст();
		ИсходныйКод = СтрЗаменить(ИсходныйКод, "@StartUML", "");
		ИсходныйКод = СтрЗаменить(ИсходныйКод, "@EndUML", "");
		ИсходныйКод = СтрЗаменить(ИсходныйКод, "' КодировкаТекста: UTF-8", "");
		ИсходныйКод = СтрЗаменить(ИсходныйКод, Символы.ПС + Символы.ПС, "");
	Иначе
		ТекстСообщения = "Ошибка при чтении файла!";
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДереваМетеданных

// Процедура рекурсивно устанавливает/снимает пометку для вложенных элементов начиная
// с передаваемого элемента.
//
// Параметры:
// Элемент   - ДанныеФормыКоллекцияЭлементовДерева - Элемент дерева
//
&НаКлиенте
Процедура ПометитьВложенныеЭлементы(Элемент)
	
	ВложенныеЭлементы = Элемент.ПолучитьЭлементы();
	
	Если ВложенныеЭлементы.Количество() = 0 Тогда
		Если Не Элемент.ЭтоОбъектМетаданных Тогда
			Элемент.Пометка = 0;
		КонецЕсли;
	Иначе
		Для Каждого ВложенныйЭлемент Из ВложенныеЭлементы Цикл
			ВложенныйЭлемент.Пометка = Элемент.Пометка;
			ПометитьВложенныеЭлементы(ВложенныйЭлемент);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьВидимостьДоступность(Форма)
	
	Объект 			= Форма.Объект;
	ЭлементыФормы 	= Форма.Элементы;
	
	ЭлементыФормы.ФормироватьДетальныеОтношенияНаУровнеРеквизитов.Доступность = Форма.ФормироватьРеквизитныйСоставОбъектов;
	ЭлементыФормы.ВсеПодчиненныеЭлементы.Доступность = Форма.ФормироватьРеквизитныйСоставОбъектов;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПоУмолчанию()

	ЗаполнитьИсходникБиблиотекиПоУмолчанию();
	ЗаполнитьНастройкиПоУмолчанию(); 
	ЗаполнитьСписокОбъектовМетаданныхПоУмолчанию();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсходникБиблиотекиПоУмолчанию()
	
	Если СтандартнаяСхема Тогда
		ТаблПрефиксов = ЭтаФорма.ТаблицаПрефиксов;
		ИсходныйКодПодключаемойБиблиотеки = "'---- Типы объектов ----";
		ПрефиксДляДругих = "";
		Для каждого Стр Из ТаблПрефиксов Цикл
			ИсходныйКодПодключаемойБиблиотеки = ИсходныйКодПодключаемойБиблиотеки + Символы.ПС
			+ Стр.Префикс + " =" + Стр.ТипМетаданных;
			Если Стр.Пометка Тогда
				ПрефиксДляДругих = Стр.Префикс;
			КонецЕсли;
		КонецЦикла;
		ИсходныйКодПодключаемойБиблиотеки = ИсходныйКодПодключаемойБиблиотеки + Символы.ПС
		+ ПрефиксДляДругих + " =Все_другие_объекты
		|
		|" + ПрефиксДляДругих + " =Обозначения_Типов_Данных{
	// см. ПрефиксПоТипу()
		|	-Ссылка // красный квадратик
		|	#Булево // желтый ромбик
		|	~Дата   // синий треугольник
		|	*Число  // черная точка
		|	+Строка // зелёный кружок
		|}
		|";
	Иначе
		ИсходныйКодПодключаемойБиблиотеки = "'>>> библиотека 1ce-icons-for-plantuml (ext)
		|!define v8_PUML https://raw.githubusercontent.com/plastinin/1ce-icons-for-plantuml/extended/dist/
		|!include v8_PUML/common.puml
		|!include v8_PUML/v8_AccRg.puml
		|!include v8_PUML/v8_Document.puml
		|!include v8_PUML/v8_Catalog.puml
		|!include v8_PUML/v8_InfoRg.puml
		|!include v8_PUML/v8_ChartsOfCharacteristicTypes.puml
		|!include v8_PUML/v8_DefinedTypes.puml
		|!include v8_PUML/v8_Enum.puml
		|'<<<
		|";
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Внимание! Проверьте доступ к сайту https://raw.githubusercontent.com";
		Сообщение.Сообщить();
	КонецЕсли;
	
	ИсходныйКод = ИсходныйКодПодключаемойБиблиотеки;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиПоУмолчанию()
	
	ПараметрыПоУмолчанию = ПараметрыПоУмолчанию();
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ПараметрыПоУмолчанию);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОбъектовМетаданныхПоУмолчанию()
	
	Если КоллекцияВыбираемыхОбъектовМетаданных.Количество() Тогда
		КоллекцияВыбираемыхОбъектовМетаданных.Очистить();
	КонецЕсли;
	
	мИменаГрупп = ИменаГруппМетаданныхДляВыбора();
	Для каждого ИмяГруппы Из мИменаГрупп Цикл
		КоллекцияВыбираемыхОбъектовМетаданных.Добавить(ИмяГруппы);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ИменаГруппМетаданныхДляВыбора()
	стрГруппы = "Справочники,Документы,Отчеты,Обработки"
	+ ",РегистрыНакопления,РегистрыСведений,РегистрыБухгалтерии,РегистрыРасчета"
	+ ",ПланыВидовХарактеристик,ПланыСчетов,ПланыВидовРасчета,ПланыОбмена"
	+ ",Задачи,БизнесПроцессы,Перечисления";
	МассивИменГрупп = СтрРазделить(стрГруппы, ",");
	Возврат МассивИменГрупп;
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокПодсистем(СписокПодсистем) 
	Для Каждого Подсистема Из СписокПодсистем Цикл
		Если Подсистема.ВключатьВКомандныйИнтерфейс Тогда
			ЭлементыПодсистемСКоманднымИнтерфейсом.Добавить(Подсистема.ПолноеИмя());
		КонецЕсли;
		
		Если Подсистема.Подсистемы.Количество() > 0 Тогда
			ЗаполнитьСписокПодсистем(Подсистема.Подсистемы);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ТаблицаОбъектовМетаданных()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Имя");
	ТЗ.Колонки.Добавить("Синоним");
	ТЗ.Колонки.Добавить("Картинка");
	ТЗ.Колонки.Добавить("КартинкаОбъекта");
	ТЗ.Колонки.Добавить("ЭтоКоллекцияОбщие");
	ТЗ.Колонки.Добавить("ПолноеИмя");
	ТЗ.Колонки.Добавить("Родитель");
	
	НоваяСтрокаТЗ("Подсистемы",                   "Подсистемы",                     35, 36, Истина, ТЗ);
	НоваяСтрокаТЗ("ОбщиеМодули",                  "Общие модули",                   37, 38, Истина, ТЗ);
	НоваяСтрокаТЗ("ПараметрыСеанса",              "Параметры сеанса",               39, 40, Истина, ТЗ);
	НоваяСтрокаТЗ("Роли",                         "Роли",                           41, 42, Истина, ТЗ);
	НоваяСтрокаТЗ("ПланыОбмена",                  "Планы обмена",                   43, 44, Истина, ТЗ);
	НоваяСтрокаТЗ("КритерииОтбора",               "Критерии отбора",                45, 46, Истина, ТЗ);
	НоваяСтрокаТЗ("ПодпискиНаСобытия",            "Подписки на события",            47, 48, Истина, ТЗ);
	НоваяСтрокаТЗ("РегламентныеЗадания",          "Регламентные задания",           49, 50, Истина, ТЗ);
	НоваяСтрокаТЗ("ФункциональныеОпции",          "Функциональные опции",           51, 52, Истина, ТЗ);
	НоваяСтрокаТЗ("ПараметрыФункциональныхОпций", "Параметры функциональных опций", 53, 54, Истина, ТЗ);
	НоваяСтрокаТЗ("ХранилищаНастроек",            "Хранилища настроек",             55, 56, Истина, ТЗ);
	НоваяСтрокаТЗ("ОбщиеФормы",                   "Общие формы",                    57, 58, Истина, ТЗ);
	НоваяСтрокаТЗ("ОбщиеКоманды",                 "Общие команды",                  59, 60, Истина, ТЗ);
	НоваяСтрокаТЗ("ГруппыКоманд",                 "Группы команд",                  61, 62, Истина, ТЗ);
	НоваяСтрокаТЗ("Интерфейсы",                   "Интерфейсы",                     63, 64, Истина, ТЗ);
	НоваяСтрокаТЗ("ОбщиеМакеты",                  "Общие макеты",                   65, 66, Истина, ТЗ);
	НоваяСтрокаТЗ("ОбщиеКартинки",                "Общие картинки",                 67, 68, Истина, ТЗ);
	НоваяСтрокаТЗ("ПакетыXDTO",                   "XDTO-пакеты",                    69, 70, Истина, ТЗ);
	НоваяСтрокаТЗ("WebСервисы",                   "Web-сервисы",                    71, 72, Истина, ТЗ);
	НоваяСтрокаТЗ("WSСсылки",                     "WS-ссылки",                      73, 74, Истина, ТЗ);
	НоваяСтрокаТЗ("Стили",                        "Стили",                          75, 76, Истина, ТЗ);
	НоваяСтрокаТЗ("Языки",                        "Языки",                          77, 78, Истина, ТЗ);
	
	НоваяСтрокаТЗ("Константы",               "Константы", 
	БиблиотекаКартинок.Константа,              БиблиотекаКартинок.Константа,                    Ложь, ТЗ);
	НоваяСтрокаТЗ("Справочники",             "Справочники",
	БиблиотекаКартинок.Справочник,             БиблиотекаКартинок.Справочник,                   Ложь, ТЗ);
	НоваяСтрокаТЗ("Документы",               "Документы",
	БиблиотекаКартинок.Документ,               БиблиотекаКартинок.ДокументОбъект,               Ложь, ТЗ);
	НоваяСтрокаТЗ("ЖурналыДокументов",       "Журналы документов",
	БиблиотекаКартинок.ЖурналДокументов,       БиблиотекаКартинок.ЖурналДокументов,             Ложь, ТЗ);
	НоваяСтрокаТЗ("Перечисления",            "Перечисления",
	БиблиотекаКартинок.Перечисление,           БиблиотекаКартинок.Перечисление,                 Ложь, ТЗ);
	НоваяСтрокаТЗ("Отчеты",                  "Отчеты",
	БиблиотекаКартинок.Отчет,                  БиблиотекаКартинок.Отчет,                        Ложь, ТЗ);
	НоваяСтрокаТЗ("Обработки",               "Обработки",
	БиблиотекаКартинок.Обработка,              БиблиотекаКартинок.Обработка,                    Ложь, ТЗ);
	НоваяСтрокаТЗ("ПланыВидовХарактеристик", "Планы видов характеристик",
	БиблиотекаКартинок.ПланВидовХарактеристик, БиблиотекаКартинок.ПланВидовХарактеристикОбъект, Ложь, ТЗ);
	НоваяСтрокаТЗ("ПланыСчетов",             "Планы счетов",
	БиблиотекаКартинок.ПланСчетов,             БиблиотекаКартинок.ПланСчетовОбъект,             Ложь, ТЗ);
	НоваяСтрокаТЗ("ПланыВидовРасчета",       "Планы видов характеристик",
	БиблиотекаКартинок.ПланВидовХарактеристик, БиблиотекаКартинок.ПланВидовХарактеристикОбъект, Ложь, ТЗ);
	НоваяСтрокаТЗ("РегистрыСведений",        "Регистры сведений",
	БиблиотекаКартинок.РегистрСведений,        БиблиотекаКартинок.РегистрСведений,              Ложь, ТЗ);
	НоваяСтрокаТЗ("РегистрыНакопления",      "Регистры накопления",
	БиблиотекаКартинок.РегистрНакопления,      БиблиотекаКартинок.РегистрНакопления,            Ложь, ТЗ);
	НоваяСтрокаТЗ("РегистрыБухгалтерии",     "Регистры бухгалтерии",
	БиблиотекаКартинок.РегистрБухгалтерии,     БиблиотекаКартинок.РегистрБухгалтерии,           Ложь, ТЗ);
	НоваяСтрокаТЗ("РегистрыРасчета",         "Регистры расчета",
	БиблиотекаКартинок.РегистрРасчета,         БиблиотекаКартинок.РегистрРасчета,               Ложь, ТЗ);
	НоваяСтрокаТЗ("БизнесПроцессы",          "Бизнес-процессы",
	БиблиотекаКартинок.БизнесПроцесс,          БиблиотекаКартинок.БизнесПроцессОбъект,          Ложь, ТЗ);
	НоваяСтрокаТЗ("Задачи",                  "Задачи",
	БиблиотекаКартинок.Задача,                 БиблиотекаКартинок.ЗадачаОбъект,                 Ложь, ТЗ);
	
	Возврат ТЗ;
КонецФункции

// Добавляет новую строку в таблицу значений видов объектов метаданных
// конфигурации.
//
// Параметры:
// Имя         - Строка - имя объекта метаданных или вида объекта метаданных.
// Синоним     - Строка  - синоним объекта метаданных.
// Картинка    - Картинка  - картинка поставленная в соответствие объекту метаданных или виду объекта метаданных.
// КартинкаОбъекта - Картинка - ссылка на картинку объекта
// ЭтоКоллекцияОбщие - Булево - признак того, что текущий элемент содержит подэлементы.
// Таблица	- ТаблицаЗначений - таблица в которую добавляются эти значения
//
&НаСервере
Процедура НоваяСтрокаТЗ(Имя, Синоним, Картинка, КартинкаОбъекта, ЭтоКоллекцияОбщие, Таблица)
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.Имя               = Имя;
	НоваяСтрока.Синоним           = Синоним;
	НоваяСтрока.Картинка          = Картинка;
	НоваяСтрока.КартинкаОбъекта   = КартинкаОбъекта;
	НоваяСтрока.ЭтоКоллекцияОбщие = ЭтоКоллекцияОбщие;
	
КонецПроцедуры

// Процедура заполняет дерево значений объектов конфигурации.
// Если список значений "Параметры.КоллекцииВыбираемыхОбъектовМетаданных" не пуст, тогда
// дерево будет ограничено переданным списком коллекций объектов метаданных.
//  Если объекты метаданных в сформированном дереве будут найдены в списке значений
// "Параметры.ВыбранныеОбъектыМетаданных", тогда они будут помечены, как выбранные.
//
&НаСервере
Процедура ДеревоОбъектовМетаданныхЗаполнить()
	
	// Создание предопределенных элементов.
	ПараметрыЭлемента = НовыйЭлементДереваОбъектовМетаданных(Метаданные.Имя, Метаданные.Синоним, Метаданные.Синоним,
															ДеревоОбъектовМетаданных, 79);
	ЭлементКонфигурация = НоваяСтрокаДерева(ПараметрыЭлемента);
	
	ПараметрыЭлемента = НовыйЭлементДереваОбъектовМетаданных("Общие", "Общие", "Общие", ЭлементКонфигурация, 80);
	ЭлементОбщие = НоваяСтрокаДерева(ПараметрыЭлемента);
	
	// Заполнение дерева объектов метаданных.
	КоллекцииОбъектовМетаданных =  ТаблицаОбъектовМетаданных();
	Для Каждого Строка Из КоллекцииОбъектовМетаданных Цикл
		Если КоллекцияВыбираемыхОбъектовМетаданных.Количество() = 0
			Или КоллекцияВыбираемыхОбъектовМетаданных.НайтиПоЗначению(Строка.Имя) <> Неопределено Тогда
			Строка.Родитель = ?(Строка.ЭтоКоллекцияОбщие, ЭлементОбщие, ЭлементКонфигурация);
			ДобавитьЭлементДереваОбъектовМетаданных(Строка, ?(Строка.Имя = "Подсистемы", Метаданные.Подсистемы, Неопределено));
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементОбщие.ПолучитьЭлементы().Количество() = 0 Тогда
		ЭлементКонфигурация.ПолучитьЭлементы().Удалить(ЭлементОбщие);
	КонецЕсли;
	
КонецПроцедуры 

// Возвращает новую структуру параметров элемента дерева объектов метаданных.
//
// Возвращаемое значение:
//   Структура с полями:
//     Имя           - Строка - имя родительского элемента.
//     Синоним       - Строка - синоним родительского элемента.
//     Пометка       - Булево - начальная пометка коллекции или объекта метаданных.
//     Картинка      - Число - код картинки родительского элемента.
//     КартинкаОбъекта - Число - код картинки подэлемента.
//     Родитель        - ссылка на элемента дерева значений, который является корнем
//                       для добавляемого элемента.
//

// Функция - Новый элемент дерева объектов метаданных
//
// Параметры:
//  Имя				 - Строка -  Имя элемента
//  ПолноеИмя		 - Строка -  Полное Имя элемента
//  Синоним			 - Строка -  Синоним
//  Родитель		 - СтрокаДерева, Неопределено -  если есть, то родительский элемент
//  Картинка		 - Число - код картинки
//  КартинкаОбъекта	 - Число - код картинки Объекта
//  Пометка			 - Булево - отметка
// 
// Возвращаемое значение:
//  Структура - с ткми же полями
//
Функция НовыйЭлементДереваОбъектовМетаданных(Имя, ПолноеИмя, Синоним, Родитель, 
											Картинка = 0, КартинкаОбъекта = 0, Пометка = Ложь)
	СтруктураЭлементаДерева = Новый Структура("Имя, ПолноеИмя, Синоним", Имя, ПолноеИмя, Синоним);
	СтруктураЭлементаДерева.Вставить("Пометка", Пометка);
	
	СтруктураЭлементаДерева.Вставить("Картинка", Картинка);
	СтруктураЭлементаДерева.Вставить("КартинкаОбъекта", КартинкаОбъекта);
	
	СтруктураЭлементаДерева.Вставить("Родитель", Родитель);
	Возврат СтруктураЭлементаДерева;
КонецФункции

&НаСервере
Функция ПустаяПодсистема(Подсистемы, ПараметрыЭлемента)
	Возврат ( (Подсистемы <> Неопределено  И Параметры.Свойство("ТолькоПодсистемыСКИ") 
		И Не ПустаяСтрока(ПараметрыЭлемента.ПолноеИмя) 
		И ЭлементыПодсистемСКоманднымИнтерфейсом.НайтиПоЗначению(ПараметрыЭлемента.ПолноеИмя) = Неопределено) )
	// Если нет ни одного объекта метаданных из нужной ветки. 
	// Например, нет ни одного регистра бухгалтерии,
	// то корень "Регистры бухгалтерии" добавлять не нужно.
	Или (Подсистемы = Неопределено И Метаданные[ПараметрыЭлемента.Имя].Количество() = 0);
КонецФункции

// Функция - Добавить элемент дерева объектов метаданных
// Добавляет новую строку в дерево значений формы (дерево),
// а также заполняет полный набор строк из метаданных по переданному параметру.
// Если параметр Подсистемы заполнен, то вызывается рекурсивно для всех дочерних подсистем.
//
// Параметры:
//  ПараметрыЭлемента	 - Структура - Структура с полями:
//     Имя           - имя родительского элемента.
//     Синоним       - синоним родительского элемента.
//     Пометка       - начальная пометка коллекции или объекта метаданных.
//     Картинка      - код картинки родительского элемента.
//     КартинкаОбъекта - код картинки подэлемента.
//     Родитель        - ссылка на элемента дерева значений, который является корнем
//                       для добавляемого элемента.
//   Подсистемы  - Строка - если заполнен, то содержит значение Метаданные.Подсистемы (коллекцию элементов).
//   Проверять   - Булево- Булево - признак проверки на принадлежность родительским подсистемам.
// 
// Возвращаемое значение:
//  Строка - Строка дерева объектов метаданных.
//
&НаСервере
Функция ДобавитьЭлементДереваОбъектовМетаданных(ПараметрыЭлемента, Подсистемы = Неопределено, Проверять = Истина)
	
	// Проверка на наличие командного интерфейса только в листьях дерева.
	Если ПустаяПодсистема(Подсистемы, ПараметрыЭлемента) Тогда // см. выше
		Возврат Неопределено;
	КонецЕсли;
	
	Если Подсистемы = Неопределено Тогда
		РодТипМетаданных = НоваяСтрокаДерева(ПараметрыЭлемента, Ложь);
		
		Для Каждого Эл Из Метаданные[ПараметрыЭлемента.Имя] Цикл
			ПараметрыЭлемента = НовыйЭлементДереваОбъектовМетаданных(Эл.Имя, Эл.ПолноеИмя(), Эл.Синоним, РодТипМетаданных);
			НоваяСтрокаДерева(ПараметрыЭлемента, Истина);
		КонецЦикла;
		
		Возврат РодТипМетаданных;
	КонецЕсли;
	
	// Если нет ни одной подсистемы, то корень "Подсистемы" добавлять не нужно.
	Если Подсистемы.Количество() = 0 И ПараметрыЭлемента.Имя = "Подсистемы" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НоваяСтрока = НоваяСтрокаДерева(ПараметрыЭлемента, Подсистемы <> Неопределено И Подсистемы <> Метаданные.Подсистемы);
	
	Для Каждого Эл Из Подсистемы Цикл
		Если (Не Проверять
			Или Параметры.РодительскиеПодсистемы.Количество() = 0
			Или Параметры.РодительскиеПодсистемы.НайтиПоЗначению(Эл.Имя) <> Неопределено) Тогда
			ПолноеИмя = Эл.ПолноеИмя();
			ПараметрыЭлемента = НовыйЭлементДереваОбъектовМетаданных(Эл.Имя, ПолноеИмя, Эл.Синоним,
								НоваяСтрока, Эл.Картинка, Эл.КартинкаОбъекта);
			ДобавитьЭлементДереваОбъектовМетаданных(ПараметрыЭлемента, Эл.Подсистемы, Ложь);
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаСервере
Функция НоваяСтрокаДерева(ПарамСтроки, ЭтоОбъектМетаданных = Ложь)
	
	Коллекция = ПарамСтроки.Родитель.ПолучитьЭлементы();
	НоваяСтрока = Коллекция.Добавить();
	НоваяСтрока.Имя                 = ПарамСтроки.Имя;
	НоваяСтрока.Представление       = ?(ЗначениеЗаполнено(ПарамСтроки.Синоним), ПарамСтроки.Синоним, ПарамСтроки.Имя);
	Пометка = ?(ВыбранныеОбъектыМетаданных.НайтиПоЗначению(ПарамСтроки.ПолноеИмя) = Неопределено, 0, 1);
	НоваяСтрока.Пометка             = Пометка;
	НоваяСтрока.Картинка            = ПарамСтроки.Картинка;
	НоваяСтрока.ПолноеИмя           = ПарамСтроки.ПолноеИмя;
	НоваяСтрока.ЭтоОбъектМетаданных = ЭтоОбъектМетаданных;
	
	Если НоваяСтрока.ЭтоОбъектМетаданных 
		И НоваяСтрока.ПолноеИмя = НачальноеЗначениеВыбора Тогда
		ИдентификаторТекущейСтрокиПриОткрытии = НоваяСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
	Возврат НоваяСтрока;
	
КонецФункции

// Процедура рекурсивно устанавливает/снимает пометку для родителей передаваемого элемента.
//
// Параметры:
// Элемент    - ДанныеФормыКоллекцияЭлементовДерева - Элемент дерева
//
&НаКлиенте
Процедура ПометитьЭлементыРодителей(Элемент)
	Пометка2 = 2; // ЕстьПомеченные И ЕстьНепомеченные
	Родитель = Элемент.ПолучитьРодителя();
	
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтроки = Родитель.ПолучитьИдентификатор();
	Элементы.ДеревоОбъектовМетаданных.Развернуть(ИдентификаторСтроки);
	
	ЭлементыРодителя = Родитель.ПолучитьЭлементы();
	Если ЭлементыРодителя.Количество() = 0 Тогда
		Родитель.Пометка = 0;
	ИначеЕсли Элемент.Пометка = Пометка2 Тогда
		Родитель.Пометка = Пометка2;
	Иначе
		Родитель.Пометка = ЗначениеПометкиЭлементов(ЭлементыРодителя);
	КонецЕсли;
	
	ПометитьЭлементыРодителей(Родитель);
	
КонецПроцедуры

&НаКлиенте
Функция ЗначениеПометкиЭлементов(ЭлементыРодителя)
	Пометка2 = 2; // ЕстьПомеченные И ЕстьНепомеченные
	ЕстьПомеченные   = Ложь;
	ЕстьНепомеченные = Ложь;
	
	Для каждого ЭлементРодителя Из ЭлементыРодителя Цикл
		
		Если ЭлементРодителя.Пометка = Пометка2 
			ИЛИ (ЕстьПомеченные И ЕстьНепомеченные) Тогда
			ЕстьПомеченные   = Истина;
			ЕстьНепомеченные = Истина;
			Прервать;
		ИначеЕсли ЭлементРодителя.ЭтоОбъектМетаданных Тогда
			ЕстьПомеченные   = ЕстьПомеченные   ИЛИ    ЭлементРодителя.Пометка;
			ЕстьНепомеченные = ЕстьНепомеченные ИЛИ НЕ ЭлементРодителя.Пометка;
		Иначе
			ВложенныеЭлементы = ЭлементРодителя.ПолучитьЭлементы();
			Если ВложенныеЭлементы.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			ЗначениеПометкиВложенныхЭлементов = ЗначениеПометкиЭлементов(ВложенныеЭлементы);
			ЕстьПомеченные   = (ЕстьПомеченные   ИЛИ    ЭлементРодителя.Пометка ИЛИ    ЗначениеПометкиВложенныхЭлементов);
			ЕстьНепомеченные = (ЕстьНепомеченные ИЛИ НЕ ЭлементРодителя.Пометка ИЛИ НЕ ЗначениеПометкиВложенныхЭлементов);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ?(ЕстьПомеченные, Пометка2, 0);
	
КонецФункции

&НаСервере
Процедура ПометитьЭлементыРодителейНаСервере(Элемент)
	Пометка2 = 2; // ЕстьПомеченные И ЕстьНепомеченные
	Родитель = Элемент.ПолучитьРодителя();
	
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыРодителя = Родитель.ПолучитьЭлементы();
	Если ЭлементыРодителя.Количество() = 0 Тогда
		Родитель.Пометка = 0;
	ИначеЕсли Элемент.Пометка = Пометка2 Тогда
		Родитель.Пометка = Пометка2;
	Иначе
		Родитель.Пометка = ЗначениеПометкиЭлементовНаСервере(ЭлементыРодителя);
	КонецЕсли;
	
	ПометитьЭлементыРодителейНаСервере(Родитель);
	
КонецПроцедуры

&НаСервере
Функция ЗначениеПометкиЭлементовНаСервере(ЭлементыРодителя)
	Пометка2 = 2; // ЕстьПомеченные И ЕстьНепомеченные
	ЕстьПомеченные    = Ложь;
	ЕстьНепомеченные = Ложь;
	
	Для каждого ЭлементРодителя Из ЭлементыРодителя Цикл
		
		Если ЭлементРодителя.Пометка = Пометка2 ИЛИ (ЕстьПомеченные И ЕстьНепомеченные) Тогда
			ЕстьПомеченные    = Истина;
			ЕстьНепомеченные = Истина;
			Прервать;
		ИначеЕсли ЭлементРодителя.ЭтоОбъектМетаданных Тогда
			ЕстьПомеченные    = ЕстьПомеченные    ИЛИ    ЭлементРодителя.Пометка;
			ЕстьНепомеченные = ЕстьНепомеченные ИЛИ НЕ ЭлементРодителя.Пометка;
		Иначе
			ВложенныеЭлементы = ЭлементРодителя.ПолучитьЭлементы();
			Если ВложенныеЭлементы.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			ЗначениеПометкиВложенныхЭлементов = ЗначениеПометкиЭлементовНаСервере(ВложенныеЭлементы);
			ЕстьПомеченные   = ЕстьПомеченные ИЛИ ЭлементРодителя.Пометка ИЛИ ЗначениеПометкиВложенныхЭлементов;
			ЕстьНепомеченные = ЕстьНепомеченные ИЛИ НЕ ЭлементРодителя.Пометка ИЛИ НЕ ЗначениеПометкиВложенныхЭлементов;
		КонецЕсли;
	КонецЦикла;
	
	Пометка1 = ?(ЕстьПомеченные, 1, 0);
	Возврат ?(ЕстьПомеченные И ЕстьНепомеченные, Пометка2, Пометка1);
КонецФункции

// Процедура - Начальная пометка коллекций
// Процедура НачальнаяПометкаКоллекций устанавливает пометку для коллекций
// объектов метаданных, которые не имеют объектов метаданных (истина) и 
// которые имеют объекты метаданных с заданной пометкой.
//
// Параметры:
// Родитель - ДанныеФормыКоллекцияЭлементовДерева - Родительский элемент
//
Процедура НачальнаяПометкаКоллекций(Родитель)
	
	ВложенныеЭлементы = Родитель.ПолучитьЭлементы();
	
	Для Каждого ВложенныйЭлемент Из ВложенныеЭлементы Цикл
		Если ВложенныйЭлемент.Пометка Тогда
			ПометитьЭлементыРодителейНаСервере(ВложенныйЭлемент);
		КонецЕсли;
		НачальнаяПометкаКоллекций(ВложенныйЭлемент);
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Получение данных
// Процедура для заполнения списка выбранных элементов дерева.
//
// Параметры:
//  Родитель - ДанныеФормыЭлементДерева - родительский элемент дерева
//
&НаСервере
Процедура ПолучениеДанных(Родитель = Неопределено)
	
	Родитель = ?(Родитель = Неопределено, ДеревоОбъектовМетаданных, Родитель);
	
	КоллекцияЭлементов = Родитель.ПолучитьЭлементы();
	
	Для Каждого Элемент Из КоллекцияЭлементов Цикл
		Если Элемент.Пометка = 1 И Не ПустаяСтрока(Элемент.ПолноеИмя) Тогда
			ВыбранныеОбъектыМетаданных.Добавить(Элемент.ПолноеИмя);
		КонецЕсли;
		ПолучениеДанных(Элемент);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область КодированиеДанных

// Функция - Сгенерированное изображение
//           Формирует на основании текстового описания в формате UML изображение, содержащее UML - диаграмму
//           Формат описания см. https://plantuml.com/ru/
// Параметры:
//  Данные		 - Строка	  -  текстовое описание диаграммы
//  Параметры	 - Структура  -  Параметры доступа к серверу рендеринга ( см. функцию ПараметрыПоУмолчанию)
// 
// Возвращаемое значение:
//  Структура - содержащая
//				ОтветСервера      - HTTPОтвет - Данные, полученные от сервера рендеринга
//				АдресИзображения  - Строка - Адрес во временном хранилище, содержащее данные изображения
//
Функция СгенерированноеИзображение(Данные, Параметры) 
	
	ДвоичныеДанныеСтроки = ПолучитьДвоичныеДанныеИзСтроки(Данные);
	СжатыеДанные = СжатыеДанные(ДвоичныеДанныеСтроки);
	Base64Строка = Base64Строка(СжатыеДанные);
	ФорматPlantUML = ФорматPlantUML(Base64Строка);
	Соединение = Новый HTTPСоединение(Параметры.СерверРендеринга, , , , , Параметры.ТаймаутСоединения);
	ТекстЗапроса = РесурсСервера + ФорматPlantUML;
	Запрос = Новый HTTPЗапрос(ТекстЗапроса);
	Ответ = Соединение.Получить(Запрос);

	// ответ  не анализируется - при необходимости нужно дописать его анализ
	ДвоичныеДанныеКартинки = Ответ.ПолучитьТелоКакДвоичныеДанные();
	Результат = Новый Структура;
	Результат.Вставить("ОтветСервера", Ответ);
	Результат.Вставить("АдресИзображения", ПоместитьВоВременноеХранилище(ДвоичныеДанныеКартинки));

	Возврат Результат;

КонецФункции // ()

Функция GZipHeader()

	Возврат 10;

КонецФункции

Функция GZipFooter()

	Возврат 8;

КонецФункции

Функция ЗаписатьZip(Данные)

#Если МобильноеПриложениеСервер Тогда
	ВызватьИсключение(НСтр("ru = 'Работа с Zip-файлами в мобильной платформе не поддерживается'"));
#Иначе
	ВременныйФайл = ПолучитьИмяВременногоФайла(".bin");
	Данные.Записать(ВременныйФайл);
	ПотокZip = Новый ПотокВПамяти;
	ЗаписьZip = Новый ЗаписьZipФайла(ПотокZip);
	ЗаписьZip.Добавить(ВременныйФайл);
	ЗаписьZip.Записать();
	УдалитьФайлы(ВременныйФайл);

	Возврат ПотокZip.ЗакрытьИПолучитьДвоичныеДанные();
#КонецЕсли

КонецФункции

Функция СжатыеДанные(Данные) 

	ЧтениеДанных = Новый ЧтениеДанных(ЗаписатьZip(Данные));

	НачальноеСмещение = 14;
	ЧтениеДанных.Пропустить(НачальноеСмещение);
	CRC32 = ЧтениеДанных.ПрочитатьЦелое32();

	РазмерСжатыхДанных = ЧтениеДанных.ПрочитатьЦелое32();
	РазмерИсходныхДанных = ЧтениеДанных.ПрочитатьЦелое32();

	РазмерИмениФайла = ЧтениеДанных.ПрочитатьЦелое16();
	РазмерДополнительногоПоля = ЧтениеДанных.ПрочитатьЦелое16();
	ЧтениеДанных.Пропустить(РазмерИмениФайла + РазмерДополнительногоПоля);

	ПотокGZip = Новый ПотокВПамяти;
	ЗаписьДанных = Новый ЗаписьДанных(ПотокGZip);
	ЧтениеДанных.КопироватьВ(ЗаписьДанных, РазмерСжатыхДанных);
	
	Возврат ПотокGZip.ЗакрытьИПолучитьДвоичныеДанные();

КонецФункции

Функция ФорматPlantUML(Данные) 
	
	Результат = "";
	СтрокаИскомая	  = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
	СтрокаПодстановки = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz-_"; 
	Для Счетчик = 0 По СтрДлина(Данные) - 1 Цикл     
		ТекСимвол = Сред(Данные, счетчик + 1, 1);
		Поз = СтрНайти(СтрокаИскомая, ТекСимвол); 
		Если ТекСимвол = Символы.ПС ИЛИ ТекСимвол = Символы.ВК Тогда
		   Продолжить;
		КонецЕсли;
		Если Поз > 0  Тогда
			Результат = Результат + Сред(СтрокаПодстановки, Поз, 1);
		Иначе
			Результат = Результат + ТекСимвол; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;   
	
КонецФункции 

#КонецОбласти

#Область ФормированиеКодаДиаграммы

&НаСервере
Процедура СгенерироватьКодНаСервере()

	Если СтандартнаяСхема Тогда
		ИсходныйКодПодключаемойБиблиотеки = "";
	КонецЕсли;
	
	СборкаКода = Новый Массив;
	СборкаКода.Добавить(ИсходныйКодПодключаемойБиблиотеки);
	
	СборкаВзаимосвязей = Новый Массив;

	ВыбранныеОбъектыМетаданных.Очистить();
	ПолучениеДанных();
	
	Для Каждого ЭлементСписка Из ВыбранныеОбъектыМетаданных Цикл
		
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ЭлементСписка.Значение);

		МассивИмен = СтрРазделить(ЭлементСписка.Значение, "."); 
		ТипМета = МассивИмен[0];
		Если СтандартнаяСхема Тогда
			Префикс = ТипКласса(ТипМета) + " " + ТипМета + ".";
		Иначе
			Префикс = "_" + ТипМета;
		КонецЕсли;
		СтрокаМетаданные = СформироватьСтрокуМетаданных(Префикс, МетаданныеОбъекта, СтандартнаяСхема);
		
		ДополнитьОписаниемКоллекции(СтрокаМетаданные, МетаданныеОбъекта, СборкаВзаимосвязей,
			ВыбранныеОбъектыМетаданных, ?( ТипМета = "Перечисление", "ЗначенияПеречисления", "Реквизиты") );
 
		СборкаКода.Добавить(СтрокаМетаданные);

	КонецЦикла;
	
	СборкаКода.Добавить(СтрСоединить(СборкаВзаимосвязей, Символы.ПС));
	ИсходныйКод = СтрСоединить(СборкаКода, Символы.ПС);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьСтрокуМетаданных(Команда, МетаданныеОбъекта, СтандартнаяСхема = Истина)
	Если СтандартнаяСхема Тогда
		Возврат СтрШаблон("%1%2", Команда, МетаданныеОбъекта.Имя);
	Иначе
		Возврат СтрШаблон("%1(%2, ""%3"")", Команда, МетаданныеОбъекта.Имя , МетаданныеОбъекта.Синоним);
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ДополнитьОписаниемКоллекции(СтрокаМетаданные, МетаданныеОбъекта, СборкаВзаимосвязей, 
				ВыбранныеОбъектыМетаданных, ПутьКоллекция = "Реквизиты")
	
	Коллекция = МетаданныеОбъекта[ПутьКоллекция];
	СборкаСтроки = Новый Массив;
	
	Если ФормироватьРеквизитныйСоставОбъектов Тогда
		СборкаСтроки.Добавить(СтрШаблон("%1 {", СтрокаМетаданные));
	КонецЕсли;

	// Временная переменная для упрощения работы с функциями
	ДопПараметры = Новый Структура("МетаданныеОбъекта, СборкаВзаимосвязей, ВыбранныеОбъектыМетаданных",
									МетаданныеОбъекта, СборкаВзаимосвязей, ВыбранныеОбъектыМетаданных);
	ДопПараметры.Вставить("Префикс", "");
	
	Если ЕстьСтандартныеРеквизиты(СтрокаМетаданные) Тогда // ЕстьСтандартныеРеквизиты
		ДопПараметры.Вставить("Префикс", "{static} "); // {static}  - нижнее подчёркивание
		ДополнитьОписаниеЭлементаПоКоллекции(МетаданныеОбъекта.СтандартныеРеквизиты, СборкаСтроки, ДопПараметры);
		ДопПараметры.Вставить("Префикс", "");
	КонецЕсли;
	
	Если ЭтоРегистр(СтрокаМетаданные) Тогда  // все регистры одинаково обрабатываем
		
		ДополнитьОписаниеЭлементаРегистра("Измерения", СборкаСтроки, ДопПараметры);
		ДополнитьОписаниеЭлементаРегистра("Ресурсы", СборкаСтроки, ДопПараметры);
		ДополнитьОписаниеЭлементаРегистра("Реквизиты", СборкаСтроки, ДопПараметры);
		
	Иначе // Реквизиты
		
		ДополнитьОписаниеЭлементаПоКоллекции(Коллекция, СборкаСтроки, ДопПараметры);
		
	КонецЕсли;
	
	Если ЕстьТабличныеЧастиУОбъекта(СтрокаМетаданные) Тогда // Объекты, у которых есть ТабличныеЧасти
		Для Каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
			СборкаСтроки.Добавить(СтрШаблон("%1---%2---", Символы.Таб, ТабличнаяЧасть.Имя));
			ДополнитьОписаниеЭлементаПоКоллекции(ТабличнаяЧасть.Реквизиты, СборкаСтроки, ДопПараметры);
		КонецЦикла;
	КонецЕсли;
	
	Если ЕстьХарактеристики(СтрокаМетаданные) Тогда
		ДополнитьОписаниеЭлементаРегистра("!Характеристики", СборкаСтроки, ДопПараметры);
	КонецЕсли;
	
	Если СтрНайти(СтрокаМетаданные, "Задача.") > 0 Тогда
		ДополнитьОписаниеЭлементаРегистра("!Адресация", СборкаСтроки, ДопПараметры);
	КонецЕсли;

	Если ФормироватьРеквизитныйСоставОбъектов Тогда
		СборкаСтроки.Добавить("}");
		СтрокаМетаданные = СтрСоединить(СборкаСтроки, Символы.ПС);
	КонецЕсли;
	
	// Обратное распакопка из структуры ДопПараметров:
	//	МетаданныеОбъекта = не менялись, а 2 других поля - ДА !
	СборкаВзаимосвязей =  ДопПараметры.СборкаВзаимосвязей;
	ВыбранныеОбъектыМетаданных = ДопПараметры.ВыбранныеОбъектыМетаданных;
	
КонецПроцедуры 

// Процедура - Дополнить описание элемента по коллекции
//
// Параметры:
//  Коллекция	 - Структура - коллекция Объектов
//  СборкаСтроки - Массив - массив строк для сборки
//  Парам		 - Структура - {СборкаВзаимосвязей, МетаданныеОбъекта, ВыбранныеОбъектыМетаданных, Префикс}
//
&НаСервере
Процедура ДополнитьОписаниеЭлементаПоКоллекции(Коллекция, СборкаСтроки, Парам)

	Для Каждого Элемент Из Коллекция Цикл

		Попытка
			ТипДанных = Неопределено;
			ТипыЭлемента = Элемент.Тип.Типы();
		Исключение
			ТипыЭлемента = Новый Массив;
		КонецПопытки;
			
		Префикс2 = "";
		Если ФормироватьРеквизитныйСоставОбъектов Тогда
				Если ТипыЭлемента.Количество() = 1 Тогда
					ТипДанных = ТипыЭлемента[0];
					Префикс2 = ПрефиксПоТипу(ТипДанных);
				КонецЕсли;
			Префикс2 = Префикс2 + Парам.Префикс;
			СборкаСтроки.Добавить(СтрШаблон("%1 %2%3", Символы.Таб, Префикс2, Элемент.Имя));
		КонецЕсли;
		
		Если ТипыЭлемента.Количество() = 1 И Лев(Префикс2, 1) = "-" Или ТипыЭлемента.Количество() > 1 Тогда
			ДополнитьВзаимосвязи(Элемент.Имя, ТипыЭлемента, Парам);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

// Процедура - Дополнить взаимосвязи
//
// Параметры:
//  Имя			 - Строка - Имя метаданныъ
//  ТипыДанных	 - Массив	 - Массив типов данных
//  Парам		 - Структура - {СборкаВзаимосвязей, МетаданныеОбъекта, ВыбранныеОбъектыМетаданных, Префикс}
//
&НаСервере
Процедура ДополнитьВзаимосвязи(Имя, ТипыДанных, Парам)
	Если Имя = "Ссылка" Или Имя = "Родитель" Тогда
		Возврат; // ссылка на самого-себя не красиво делает петлю - "и так понятно"
	КонецЕсли;
	
	ТипИИмяОбъекта = Парам.МетаданныеОбъекта.ПолноеИмя();  // .Имя() не содержит Тип метаданных
	Для Каждого ТипДанных Из ТипыДанных Цикл
		
		Если НЕ ЭтоСсылка(ТипДанных) Тогда 
			Продолжить;
		КонецЕсли;
		
		МетаданныеСвязи = Метаданные.НайтиПоТипу(ТипДанных);
		Если ВсеПодчиненныеЭлементы  // +++ OS 19.09.2024 поиск всех зависимых элементов
			Или ВыбранныеОбъектыМетаданных.НайтиПоЗначению(МетаданныеСвязи.ПолноеИмя()) <> Неопределено Тогда
			
			ТипИИмяСвязи = МетаданныеСвязи.ПолноеИмя();
			
			Если ВсеПодчиненныеЭлементы Тогда // нужен класс и его тип, повторное объявление
				мЧасти = СтрРазделить(ТипИИмяСвязи, ".");
				ПрефиксОбъекта = ПрефиксОбъекта(мЧасти[0]);
				ТипИмяКласса = ПрефиксОбъекта + " " + ТипИИмяСвязи;
				Если Парам.СборкаВзаимосвязей.Найти(ТипИмяКласса) = Неопределено Тогда // без повторов
					Парам.СборкаВзаимосвязей.Добавить(ТипИмяКласса);
				КонецЕсли;
			КонецЕсли;
				
			Если ФормироватьДетальныеОтношенияНаУровнеРеквизитов Тогда
				Парам.СборкаВзаимосвязей.Добавить(СтрШаблон("%1 --> %2::%3", ТипИИмяСвязи, ТипИИмяОбъекта, Имя));
			Иначе
				Если МетаданныеСвязи.Имя = Парам.МетаданныеОбъекта.Имя Тогда
					Продолжить;
				КонецЕсли;
				СтрокаВзаимосвязь = СтрШаблон("%1 --> %2", ТипИИмяСвязи, ТипИИмяОбъекта);
				Если Парам.СборкаВзаимосвязей.Найти(СтрокаВзаимосвязь) = Неопределено Тогда
					Парам.СборкаВзаимосвязей.Добавить(СтрокаВзаимосвязь);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеСхемыКода

&НаСервере
Функция ТипКласса(ТипМета = "")
	Табл = ЭтаФорма.ТаблицаПрефиксов;
	
	Строки = Табл.НайтиСтроки(Новый Структура("ТипМетаданных", ТипМета));
	Если Строки = Неопределено Или Строки.Количество() = 0 Тогда
		ПрефиксКласса = ПрефиксПоУмолчанию(Табл);
	Иначе
		ПрефиксКласса = Строки[0].Префикс;
	КонецЕсли;
	
	Возврат ПрефиксКласса;
КонецФункции

&НаКлиенте
Процедура ФормироватьРеквизитныйСоставОбъектовПриИзменении(Элемент)

	ОбновитьВидимостьДоступность(ЭтаФорма);
	Если НЕ ФормироватьРеквизитныйСоставОбъектов Тогда
		ФормироватьДетальныеОтношенияНаУровнеРеквизитов = Ложь;
		ВсеПодчиненныеЭлементы = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СгенерироватьНаСервере()
	
	ПараметрыПоУмолчанию = ПараметрыПоУмолчанию();
	ЗаполнитьЗначенияСвойств(ПараметрыПоУмолчанию, ЭтаФорма);
	Результат = СгенерированноеИзображение(ИсходныйКод, ПараметрыПоУмолчанию);
	
	Если ЗначениеЗаполнено(Результат.АдресИзображения) Тогда
	 	РезультатОбработки = Результат.АдресИзображения;
	КонецЕсли; 
	
КонецПроцедуры

// Функция - Это ссылка
// Проверка того, что переданный тип является ссылочным типом данных.
// Для типа "Неопределено" возвращается Ложь.
//
// Параметры:
//  Тип	 - ТипЗначения - тип 1С
// 
// Возвращаемое значение:
//  Булево - Да/Нет
//
&НаСервереБезКонтекста
Функция ЭтоСсылка(Тип)
	
	Массив = Новый Массив;
	Массив.Добавить( Тип("Строка") );
	Массив.Добавить( Тип("Число") );
	Массив.Добавить( Тип("Булево") );
	Массив.Добавить( Тип("Дата") );
	Массив.Добавить( Тип("ОписаниеТипов") );
	Массив.Добавить( Тип("ВидДвиженияНакопления") );
	Массив.Добавить( Тип("Неопределено") );
	
	Возврат (Массив.Найти(Тип ) = Неопределено );
	
КонецФункции

&НаСервереБезКонтекста
Функция ПрефиксПоТипу(Тип)
	Префикс = ""; // пустой префикс
	
	Если ЭтоСсылка(Тип) Тогда
		Префикс = "-"; // красный квадратик
	Иначе
		Соответствие = Новый Соответствие;
		Соответствие.Вставить(Тип("Булево"), "#"); // желтый ромбик
		Соответствие.Вставить(Тип("Дата"),   "~"); // синий треугольник
		Соответствие.Вставить(Тип("Число"),  "*"); // черная точка
		Соответствие.Вставить(Тип("Строка"), "+"); // зелёный кружок
		Префикс = Соответствие.Получить(Тип);
		Если Префикс = Неопределено Тогда
			Префикс = "";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Префикс;
КонецФункции

&НаСервере
Процедура ДополнитьОписаниеЭлементаРегистра(ИмяМета, СборкаСтроки, Парам)
	МассивСтрок = Новый Массив;
	
	Если лев(ИмяМета, 1) = "!" Тогда  // нестандартные коллекции
		ИмяМета = сред(ИмяМета, 2);
		
		Если ИмяМета = "Адресация" Тогда
			Коллекция = Новый Массив;
			Адресация = Парам.МетаданныеОбъекта.Адресация;
			АдресацияТип = Новый ОписаниеТипов("РегистрСведенийМенеджер." + Адресация.Имя);
			СтруктураАдресации = Новый Структура("Имя, Тип", "РегистрСведений." + Адресация.Имя, АдресацияТип);
			Коллекция.Добавить(СтруктураАдресации);
			
		ИначеЕсли ИмяМета = "Характеристики" Тогда
			Коллекция = Новый Массив;
			Для каждого Эл Из Парам.МетаданныеОбъекта.Характеристики Цикл
				ЭлВид = Эл.ВидыХарактеристик;
				ХарактеристикиТип = Новый ОписаниеТипов("ПланВидовХарактеристикМенеджер." + ЭлВид.Имя);
				СтруктураХарактеристики = Новый Структура("Имя, Тип", ЭлВид.Имя, ХарактеристикиТип );
				Коллекция.Добавить(СтруктураХарактеристики);
				
				СтруктураХарактеристики = Новый Структура("Имя, Тип", Эл.ПолеЗначения.Имя, ЭлВид.Тип );
				Коллекция.Добавить(СтруктураХарактеристики);
			КонецЦикла;
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Неизвестная коллекция " + ИмяМета;
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
	Иначе
		Коллекция = Парам.МетаданныеОбъекта[ИмяМета];
	КонецЕсли;
	
	ДополнитьОписаниеЭлементаПоКоллекции(Коллекция, МассивСтрок, Парам); // автоматическое определение типа
		
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СборкаСтроки.Добавить("---" + ИмяМета + "---");
	Для н = 0 По МассивСтрок.ВГраница() Цикл
		СборкаСтроки.Добавить( МассивСтрок[н] );
	КонецЦикла;
	
КонецПроцедуры

// ===========================================

// Функция - Параметры по умолчанию
//           получает параметры по умолчанию, необходимые для доступа к серверу рендеоинша изображения
// Возвращаемое значение:
// Структура  - содержащая
//				СерверРендеринга    - Строка - адрес сервера, осуществляющего рендеринг
//				РесурсСервера  		- Строка - имя ресурса, ответственного за рендеринг 
//                                    Например для svg изображений это может быть "/plantuml/svg/"
//				ТаймаутСоединения   - число - максимальное время ожидания сервера
//
Функция ПараметрыПоУмолчанию()
	
	Результат = Новый Структура;
	Результат.Вставить("СерверРендеринга", "www.plantuml.com");
	Результат.Вставить("РесурсСервера", "/plantuml/png/");
	Результат.Вставить("ТаймаутСоединения", 180); // сек. = 3 мин.
	Возврат  Результат;

КонецФункции

&НаСервереБезКонтекста
Функция НовыйТипПрефикс()
	Список = Новый СписокЗначений;
	
	Список.Добавить("Справочник", "Class");  // Зелёная (С)
	Список.Добавить("Документ", "Abstract"); // Голубая (А) 
	Список.Добавить("Отчет", "Protocol");  // Серая (S)
	Список.Добавить("Обработка", "Interface");  // Фиолетовая (I)
	
	Список.Добавить("РегистрСведений", "Entity");    // Зелёная (E)
	Список.Добавить("РегистрБухгалтерии", "Entity"); // Зелёная (E)
	Список.Добавить("РегистрНакопления", "Enum");    // Красная (E
	Список.Добавить("РегистрРасчета", "Enum");       // Красная (E
	
	Список.Добавить("ПланВидовХарактеристик", "Interface"); // Фиолетовая (I)
	Список.Добавить("ПланСчетов", 			"Interface"); 	// Фиолетовая (I)
	Список.Добавить("ПланВидовРасчета",		"Interface");   // Фиолетовая (I)
		
	Список.Добавить("Задача", "Annotation");    // Красная (А)
	Список.Добавить("БизнесПроцесс", "Protocol");    // Серая (P)
	
	Список.Добавить("Перечисление", "Struct", Истина);

	Возврат Список;
КонецФункции

&НаСервере
Процедура ЗаполнитьПрефиксыПоУмолчаниюНаСервере()
	МассивПрефиксов = Новый Массив;
	МассивТипов = Новый Массив;
	
	СписокПрефиксов = НовыйТипПрефикс();
	
	ТаблицаПрефиксов.Очистить();
	Для каждого Эл Из СписокПрефиксов Цикл
		Стр = ТаблицаПрефиксов.Добавить();
		Стр.ТипМетаданных = Эл.Значение;
		Стр.Префикс = Эл.Представление;
		Стр.Пометка = Эл.Пометка;
		
		Если МассивПрефиксов.Найти(Эл.Представление) = Неопределено Тогда
			МассивПрефиксов.Добавить(Эл.Представление);
		КонецЕсли;
		Если МассивТипов.Найти(Эл.Значение) = Неопределено Тогда
			МассивТипов.Добавить(Эл.Значение);
		КонецЕсли;
	КонецЦикла;
	Элементы.ТаблицаПрефиксовПрефикс.СписокВыбора.ЗагрузитьЗначения(МассивПрефиксов);
	Элементы.ТаблицаПрефиксовТипМетаданных.СписокВыбора.ЗагрузитьЗначения(МассивТипов);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрефиксПоУмолчанию(Табл)
	ПрефиксДругие = ""; // пустой = Class (С)
	
	Для каждого Эл Из Табл Цикл
		Если Эл.Пометка Тогда
			ПрефиксДругие = Эл.Префикс;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПрефиксДругие;
КонецФункции

&НаСервере
Функция ПрефиксОбъекта( ИмяТипаМетаданных )
	Табл = ЭтаФорма.ТаблицаПрефиксов;
	Префикс = ПрефиксПоУмолчанию(Табл);

	Строки = Табл.НайтиСтроки( Новый Структура("ТипМетаданных", ИмяТипаМетаданных) );
	Если Строки <> Неопределено И Строки.Количество() > 0 Тогда
		Префикс = Строки[0].Префикс;
	КонецЕсли;
	
	Возврат Префикс;
КонецФункции

// ---------проверка списков объектов--------------------

&НаСервереБезКонтекста
Функция ЕстьТабличныеЧастиУОбъекта(СтрокаМетаданные = "")
	стрИменТиповОбъектовСТЧ = "Справочник,Документ,Обработка"
	// у регистров нет ТЧ
	+ ",ПланОбмена,ПланВидовХарактеристик,ПланСчетов,ПланВидовРасчета"
	+ ",Задача,БизнесПроцесс";
	Возврат ПроверитьВхождениеСтроки(стрИменТиповОбъектовСТЧ, СтрокаМетаданные);
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьСтандартныеРеквизиты(СтрокаМетаданные = "")
	стрИменТиповОбъектов = "Справочник,Документ" // у Обработок нет стандартных реквизитов!
	+ ",РегистрСведений,РегистрНакоплений,РегистрБухгалтерии,РегистрРасчета"
	+ ",ПланОбмена,ПланВидовХарактеристик,ПланСчетов,ПланВидовРасчета"
	+ ",Задача,БизнесПроцесс";
	Возврат ПроверитьВхождениеСтроки(стрИменТиповОбъектов, СтрокаМетаданные);
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьХарактеристики(СтрокаМетаданные = "")
	стрИменТиповОбъектов =  "Справочник,Документ"
	+ ",ПланОбмена,ПланВидовХарактеристик,ПланСчетов,ПланВидовРасчета"
	+ ",Задача,БизнесПроцесс";
 	Возврат ПроверитьВхождениеСтроки(стрИменТиповОбъектов, СтрокаМетаданные);
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоРегистр( СтрокаМетаданные = "" )
	
	стрИменТиповРегистров = "РегистрСведений,РегистрНакоплений,РегистрБухгалтерии,РегистрРасчета";
	
	Возврат ПроверитьВхождениеСтроки(стрИменТиповРегистров, СтрокаМетаданные);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьВхождениеСтроки(строкаИмен, СтрокаМетаданные = "")
	Результат = Ложь;
	
	Если СтрокаМетаданные = "" Тогда 
		Возврат Результат;
	КонецЕсли;
	
	МассивОбъектов = СтрРазделить(строкаИмен, ",");
	Для Каждого ИмяОбъекта Из МассивОбъектов Цикл
		Если СтрНайти(СтрокаМетаданные, ИмяОбъекта + ".") > 0 Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции 

#КонецОбласти

#КонецОбласти