#Область ПрограммныйИнтерфейс

// подробнее об обработке см. Инфостарт https://infostart.ru/1c/tools/2192753/

Функция СведенияОВнешнейОбработке() Экспорт
	ПараметрыРегистрации = Новый Структура;
	
	ИмяОбработки = ЭтотОбъект.Метаданные().Имя; 
	Синоним = ЭтотОбъект.Метаданные().Синоним; 
	Синоним = ?(ЗначениеЗаполнено(Синоним),Синоним, ИмяОбработки);
	
	//ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Вставить("Назначение", Новый Массив);
	ПараметрыРегистрации.Вставить("ВерсияБСП", "3.1.7.448");
	ПараметрыРегистрации.Вставить("ОпределитьНастройкиФормы", Ложь);

	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Версия", "1.0.4.1006");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("ПоказыватьОповещение", Истина);
	ПараметрыРегистрации.Вставить("Наименование", Синоним);

	ПараметрыРегистрации.Вставить("Информация", "Обработка """ + Синоним + """
	|+ 06.10.2024 - добавлен Анализ выбранных (10) расширений. Синхронизация выбора объекта в Расширении и Конфигурации.
	|+ 30.09.2024 - добавлены Характеристики у некоторых объектов, рефакторинг и улучшен код в соответствии со стандартами 1С (BSL)
	|+ 26.09.2024 добавлена возможность менять иконки у типов метаданных в таблице Префиксы объектом метаданных 1С
	| + доработан поиск связанных объектов - добавлен префикс/картинка связанного объекта, в том числе по Задачам и Бизнес-Процессам.
	| + доработан выбор объектов по подсистеме (с выключением ранее выбранных объектов)
	| + устранены мелкие ошибки и опечатки, изменены группы процедур и функций
	|+ 20.09.2024 добавлена Стандартная схема и группировки по Метаданным,
	|добавлена возможность сохранения/чтения в файл форматов PlantUML
	|изменен и улучшен интерфейс.
	|+2022 - оригинальная обработка - сохранены при выключенной [ ] Стандартная схема (нестандартная)
	|смотри подробнее Инфостарт - публикацию № 1714797");
	
	Команды = НовыйТЗ("Представление,Идентификатор,Использование,ПоказыватьОповещение");
	Команда = Команды.Добавить();
	Команда.Представление = Синоним;
	Команда.Идентификатор = ИмяОбработки;
	//Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.Использование = "ОткрытиеФормы";
	Команда.ПоказыватьОповещение = Истина;
	ПараметрыРегистрации.Вставить("Команды", Команды);
	Возврат ПараметрыРегистрации;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйТЗ(СписокКолонок)
	ТаблЗнач = Новый ТаблицаЗначений;
	
	иИмен = СтрРазделить(СписокКолонок, ",");
	Для каждого Имя из иИмен Цикл
		ТаблЗнач.Колонки.Добавить(Имя);
	КонецЦикла;
	
	Возврат ТаблЗнач
КонецФункции

#КонецОбласти